; domain
(define (domain robot-arm)
  (:requirements :typing :equality :strips)

  (:types
    wire robot location
  )

  (:predicates
    (holding ?wire - wire)
    (arm-empty ?arm - robot)
    (available ?wire - wire)
    (on ?wire - wire ?loc - location)
    (locked ?wire - wire ?loc - location)
    (inserted ?wire - wire ?loc - location)
    (move-right ?arm - robot)
    (move-left ?arm - robot)
    (move-forward ?arm - robot)
    (move-backward ?arm - robot)
    (move-home ?arm - robot)
    (is-arm2 ?arm - robot)
    (is-arm1 ?arm - robot)
    (lockstate)   
  )

  (:action pickup
    :parameters
      (?arm - robot
       ?wire - wire
       ?loc - location)
    :precondition
      (and
        (available ?wire)
        (on ?wire ?loc)
        (arm-empty ?arm)
      )
    :effect
      (and
        (not (lockstate))
        (not (available ?wire))
        (not (on ?loc ?wire))
        (holding ?wire)
        (not (arm-empty ?arm))
      )
  )

  (:action putdown
    :parameters
      (?arm - robot
       ?wire - wire
       ?loc - location)
    :precondition
      (and
        (holding ?wire)
        (is-arm1 ?arm)
      )
    :effect
      (and
        (not (lockstate))
        (on ?wire ?loc)
        (available ?wire)
        (arm-empty ?arm)
        (not (holding ?wire))
      )
  )

  (:action lock
    :parameters
      (?arm - robot
       ?wire - wire
       ?loc - location)
    :precondition
      (and
        (lockstate)
        (inserted ?wire ?loc)
        (is-arm2 ?arm)
      )
    :effect
      (and
        (not (lockstate))
        (locked ?wire ?loc)
        (not (available ?wire))
      )
  )

  (:action insert
    :parameters
      (?arm - robot
       ?wire - wire
       ?loc - location)
    :precondition
    (and
      (holding ?wire)
      (is-arm1 ?arm)
    )
    :effect
      (and
        (lockstate)
        (inserted ?wire ?loc)
        (arm-empty ?arm)
        (not (holding ?wire))
      )
  )

  (:action move-forward
    :parameters (?arm - robot)
    :precondition (and) 
    :effect (and (move-forward ?arm))
  )

  (:action move-backward
    :parameters (?arm - robot)
    :precondition (and) 
    :effect (and (move-backward ?arm))
  )

  (:action move-right
    :parameters (?arm - robot)
    :precondition (and) 
    :effect (and (move-right ?arm))
  )

  (:action move-left
    :parameters (?arm - robot)
    :precondition (and) 
    :effect (and (move-left ?arm))
  )

  (:action move-home
    :parameters (?arm - robot)
    :precondition (and) 
    :effect (and (move-home ?arm))
  )
  
)

; problem
(define (problem install-multiple-wires)
  (:domain robot-arm)
  (:objects
    arm1 arm2 - robot
    red_wire blue_wire green_wire black_wire yellow_wire - wire
    power_supply_1 power_supply_2 power_supply_3 power_supply_4 power_supply_5 power_supply_6 power_supply_7 power_supply_8 power_supply_9 table power_supply - location
  )
  (:init
    (arm-empty arm1)
    ;(on red_wire table)
    (on blue_wire table)
    (on green_wire table)
    (on black_wire table)
    (on yellow_wire table)
    ;(available red_wire)
    (inserted red_wire power_supply_7)
    (lockstate)
    (available blue_wire)
    (available green_wire)
    (available black_wire)
    (available yellow_wire)
    (is-arm2 arm2)
    (is-arm1 arm1)
    ;if there is "inserted", add (lockstate)
    ;if the wire is on the table, add(available wire)
  )
  (:goal
    (and
    (locked red_wire power_supply_7)
    (locked blue_wire power_supply_7)
    )
  )
)

; plan
1. (pickup arm1 blue_wire table)
   deleted: (lockstate) (available blue_wire) (arm-empty arm1)
   added: (holding blue_wire)
   goals met: 0 of 2
2. (insert arm1 blue_wire power_supply_7)
   deleted: (holding blue_wire)
   added: (lockstate) (inserted blue_wire power_supply_7) (arm-empty arm1)
   goals met: 0 of 2
3. (lock arm2 blue_wire power_supply_7)
   deleted: (lockstate)
   added: (locked blue_wire power_supply_7)
   goals met: 1 of 2
4. (pickup arm1 green_wire table)
   deleted: (available green_wire) (arm-empty arm1)
   added: (holding green_wire)
   goals met: 1 of 2
5. (insert arm1 green_wire power_supply_4)
   deleted: (holding green_wire)
   added: (lockstate) (inserted green_wire power_supply_4) (arm-empty arm1)
   goals met: 1 of 2
6. (lock arm2 red_wire power_supply_7)
   deleted: (lockstate)
   added: (locked red_wire power_supply_7)
   goals met: 2 of 2
